
// 2. Знайти суму цифр числа, що знаходяться між першою цифрою та останньою цифрою. 

// прохання до користувача ввести число
console.log(' 2. Знайти суму цифр числа, що знаходяться між першою цифрою та останньою цифрою. ')
var number = prompt('Введіть число: ');
console.log('Ваше число : ' + number);

// знаходження першої та останньої цифр введеного користувачем числа
var firstDigit = parseInt(number.charAt(0));
console.log('Перша цифра ' + firstDigit);
var lastDigit = parseInt(
  number.charAt(number.length - 1)
);
console.log('Остання цифра ' + lastDigit);

// цикл для знаходження суми цифр
var sum = 0;
for (var i = 1; i < number.length - 1; i++) {
  console.log(
    'Цифра всередині для додавання : ' +
      parseInt(number.charAt(i))
  );
  sum += parseInt(number.charAt(i));
}

// виведення відповіді
console.log(
  'Сума цифр між першою та останньою цифрами : ' +
    sum
);



// 6. Написати програму, яка показуватиме на екран квадрат числа, введеного користувачем. Користувач повинен сам вирішувати – вийти із програми або продовжити введення.  
//цикл поки виконується умова що користувач вводить якесь число
console.log('6. Написати програму, яка показуватиме на екран квадрат числа, введеного користувачем. Користувач повинен сам вирішувати – вийти із програми або продовжити введення.  цикл поки виконується умова що користувач вводить якесь число')
while (true) {
  //введення числа
  var number = parseInt(
    prompt('Введіть число : ')
  );

  //виведення в консоль відповіді
  console.log(
    'Квадрат числа ' +
      number +
      ' дорівнює : ' +
      number * number
  );

  //запит користувача
  var answer = prompt(
    'Хочете продовжити роботу програми? (так чи ні)'
  );

  //цикл на перевірку чи хоче користувач прододвжити введення
  if (answer.toUpperCase() === 'НІ') {
    break;
  }
}
console.log('Кінець роботи програми');


// 23. Є N сінокосарок. Перша сінокосарка працювала m годин, а кожна наступна на 10 хвилин більше, ніж попередня. Скільки годин разом пропрацювали всі сінокосарки?  
//введення потрібних даних
console.log('23. Є N сінокосарок. Перша сінокосарка працювала m годин, а кожна наступна на 10 хвилин більше, ніж попередня. Скільки годин разом пропрацювали всі сінокосарки?  введення потрібних даних')
var number = parseInt(
  prompt('Скільки кінокосарок? ')
);
console.log('Скільки кінокосарок - ' + number);

var durationOne = parseInt(
  prompt(
    'Скільки годин пропрацювала перша кінокосарка? '
  )
);
console.log(
  'Скільки годин пропрацювала перша кінокосарка - ' +
    durationOne
);
//вивидення відповіді на екран з використанням функції яка округлює число до більшого натурального(так як ми рахуємо кількість годин)
console.log(
  'Разом кінокосарки працювали: ' +
    Math.round(
      (2 * durationOne +
        (0.6 * (number - 1)) 
        / 2) *
        number
    ) +
    ' годин(и).'
);

// 30. З клавіатури вводяться числа і підсумовуються. Знайти кількість введених чисел, коли їхня сума перевищила 100.
//визначення потрібних змінних для обчислень
console.log('30. З клавіатури вводяться числа і підсумовуються. Знайти кількість введених чисел, коли їхня сума перевищила 100.визначення потрібних змінних для обчислень')
var sum = 0;
var count = 0;
const limit = 100;

//цикл на знаходження суми та перевірки виконання умови
while (sum <= limit) {
  const number = parseInt(
    prompt('Введіть число ')
  );
  if (isNaN(number)) {
    continue;
  }
  sum += number;
  count++;
}

//виведення відповіді
console.log(
  'Сума чисел перевищила 100 і кількість введених чисел становить',
  count
);

// 14. Є n бактерій червоного кольору. Через 1 такт часу червона бактерія змінюється на зелену, потім через 1 такт часу ділиться на червону та зелену.  Скільки буде всіх бактерій через k-тактів часу?  
console.log('14. Є n бактерій червоного кольору. Через 1 такт часу червона бактерія змінюється на зелену, потім через 1 такт часу ділиться на червону та зелену.  Скільки буде всіх бактерій через k-тактів часу?  ')
//запит на потрібні для обчисле значення
var n = parseInt(prompt('Початкова кількість червоних бактерій становить: '));
var k = parseInt(prompt('Кількість тактів становить: '));

//цикл на знаходження кількості бактерій після певної кількості тактів часу
for (var i = 1; i <= k; i++) {
  if (i % 2 === 1) {
    // Непарні такти: червоні бактерії змінюються на зелені
    n = n * 2;
  } else {
    // Парні такти: зелені бактерії діляться на червоні та зелені
    n = n * 2 + n;
  }
}

//виведення відповіді
console.log("Кількість бактерій після ", k, " тактів часу: ", n);


