//Задача 9. Створити функцію, яка за назвою дня тижня повертає список пар на цей день.  
var day = prompt('Розклад на який день? ');
//список днів тижня та розкладу
    const schedule = {
        "Понеділок": ["мат аналіз", "диск мат", "алгебра та геометрія" ],
        "Вівторок": ["алгебра та геометрія", "диск мат", "диск мат"],
        "Середа": ["англійська",  "англійська", "програмування"],
        "Четвер": ["упр іт проектами", "упр іт проектами", "web програмування"],
        "П'ятниця": ["мат аналіз", "програмування", "мат аналіз/web програмування"],
        "Субота": [],
        "Неділя": ["немає пар"]
        
    };
//стрілкова функція назва = параметр =>  що з ним зробити
const getSchedule = day => schedule[day];
//вивід розкладу в консоль
console.log(getSchedule(day));